# SharedParameterApplicableRule Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SharedParameterApplicableRule Constructor
SharedParameterApplicableRule Class See Also
---
Constructs an instance of SharedParameterApplicableRule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public SharedParameterApplicableRule(
	string parameterName
)
```

Visual Basic
---
```text
Public Sub New ( _
	parameterName As String _
)
```

Visual C++
---
```text
public:
SharedParameterApplicableRule(
	String^ parameterName
)
```

# ### Parameters
parameterName
    Type: System..::..String The name of the parameter that an element must support to pass this rule.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SharedParameterApplicableRule Class
Autodesk.Revit.DB Namespace